// Имеется одномерный массив array из n элементов, 
// требуется найти элемент массива, равный find
// (значение которого определяет пользователь).
// Выведем на экран индекс первого найденного элемента

int[] array = { 1, 12, 31, 4, 17, 15, 16, 17, 18 };
int n = array.Length;
int find = 17;
int index = 0;

while (index < n)
{
    if (array[index] == find)
    {
        Console.WriteLine(index);
        break; // "прервать", сработает, когда выполнится указанное выше условие
    }
    index++;
}

